
## Plan Result

[CI link](https://github.com/Terraform-TEST0928/terraform-infra/actions/runs/17210522296)


<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.test_html_image_delivery.aws_s3_bucket.image_delivery
  * module.test_html_image_delivery.aws_s3_bucket_ownership_controls.image_delivery
  * module.test_html_image_delivery.aws_s3_bucket_policy.image_delivery
  * module.test_html_image_delivery.aws_s3_bucket_public_access_block.image_delivery
  * module.test_html_image_delivery.aws_s3_bucket_website_configuration.image_delivery
  * module.test_html_image_delivery.aws_s3_object.image01_delivery
  * module.test_html_image_delivery.aws_s3_object.image02_delivery
  * module.test_html_image_delivery.aws_s3_object.image03_delivery
  * module.test_html_image_delivery.aws_s3_object.image04_delivery
  * module.test_html_image_delivery.aws_s3_object.index_delivery


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.test_html_image_delivery.aws_s3_bucket.image_delivery will be created
  + resource "aws_s3_bucket" "image_delivery" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nyj-dev01-image-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.test_html_image_delivery.aws_s3_bucket_ownership_controls.image_delivery will be created
  + resource "aws_s3_bucket_ownership_controls" "image_delivery" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.test_html_image_delivery.aws_s3_bucket_policy.image_delivery will be created
  + resource "aws_s3_bucket_policy" "image_delivery" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::nyj-dev01-image-bucket/*"
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.test_html_image_delivery.aws_s3_bucket_public_access_block.image_delivery will be created
  + resource "aws_s3_bucket_public_access_block" "image_delivery" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.test_html_image_delivery.aws_s3_bucket_website_configuration.image_delivery will be created
  + resource "aws_s3_bucket_website_configuration" "image_delivery" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.test_html_image_delivery.aws_s3_object.image01_delivery will be created
  + resource "aws_s3_object" "image01_delivery" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image01/jpg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "image01.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../modules/test_html_image_delivery/image01.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.test_html_image_delivery.aws_s3_object.image02_delivery will be created
  + resource "aws_s3_object" "image02_delivery" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image02/jpg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "image02.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../modules/test_html_image_delivery/image02.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.test_html_image_delivery.aws_s3_object.image03_delivery will be created
  + resource "aws_s3_object" "image03_delivery" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image03/jpg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "image03.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../modules/test_html_image_delivery/image03.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.test_html_image_delivery.aws_s3_object.image04_delivery will be created
  + resource "aws_s3_object" "image04_delivery" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image04/jpg"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "image04.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../modules/test_html_image_delivery/image04.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.test_html_image_delivery.aws_s3_object.index_delivery will be created
  + resource "aws_s3_object" "index_delivery" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../modules/test_html_image_delivery/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"CI_terraform","PRNumber":4,"Program":"tfcmt","SHA1":"d86712f967962ddc4727b0ea538319c7bc985192","Vars":{},"WorkflowName":"Terraform CI"} -->